// Циклы

// Пример 1. Использование цикла for для вычисления суммы и произведения n натуральных чисел
void con121()
{
    Console.Write("Введите целое число (от 3 до 9) ");
    // ввод строки, преобразование в int
    int n = int.Parse(Console.ReadLine());
    // задание начальных значений sum и pro перед телом цикла
    int sum = 0; int pro = 1;
    for (int i=1; i<=n; i++)
    { 
        sum += i; pro *= i;
        // тело цикла: вычисления и вывод
        Console.WriteLine("шаг={0} сумма = {1} произведение = {2}", i, sum, pro);
    }
Console.ReadKey();
}
con121();

// Пример 2. Использование цикла while. За один день уровень радиации уменьшается на 5%. За сколько дней он уменьшится вдвое?
void con122()
{
    Console.Write("Введите начальный уровень радиации(100 - 800 единиц):");
    double rad0 = double.Parse(Console.ReadLine());
    // задание начальных значений rad и day перед телом цикла
    double rad=rad0; int day=0;
    while (rad>rad0/2) // проверка условия уменьшения радиации вдвое
    { 
        rad *= 0.95; day++; // ежедневное уменьшение радиации на 5%
        Console.WriteLine("День {0}, радиация = {1}", day, rad);
    }
    Console.ReadKey();
}
con122();

// Пример 3. Использование циклов while и do...while для моделирования движения тела. Тело брошено вертикально вверх с начальной скоростью Vo.
// Найти максимальную высоту подъема и время полета.
// Будем считать тело материальной точкой, не учитывать сопротивление воздуха и пренебрегать изменением ускорения свободного падения с высотой.
// Выберем начало вертикальной оси координат 0Y в точке бросания тела. Свяжем начало отсчета времени с моментом бросания.
// Уравнения движения в проекции на выбранную ось имеют вид: V = Vo - g*t; y = Vo*t - g*t*t/2;
// Алгоритм решения задачи заключается в использовании исходных уравнений движения в циклах с достаточно малым шагом изменения времени, например, t +=0.001. 
// Максимальная высота подъема определяется в цикле while при условии, что скорость V >= 0, а время полета в цикле do ... while, который выполняется до тех пор, пока координата у > 0.
void con123()
{
    Console.Write("Введите начальную скорость V0 (от 12 до 40) м/c : ");
    double Vo = double.Parse(Console.ReadLine()); // ввод и преобразование
    double t = 0, y = 0, V = Vo, g = 9.81 ; // задание начальных условий
    // расчет максимальной высоты подъема тела в цикле с предусловием
    while (V >= 0)
    {
        V = Vo - g*t; y = Vo*t - g*t*t/2; t += 0.001;
    }
    Console.WriteLine("время = {0:f2} c, макс высота = {1:f2} м", t, y);
    // расчет времени полета тела в цикле с постусловием
    do 
    {
        t += 0.001; y = Vo*t - g*t*t/2;
    }
    while (y > 0);
    Console.WriteLine("время полета = {0:f2} c", t);
    Console.ReadKey();
}
con123();

// Пример 4. Реализация многократного ввода: бесконечный цикл while
void con124()
{
    // объявляем и инициализируем переменные
    double n = 0, sum = 0; string s = "";
    while (true) // бесконечный цикл while
    {
        Console.Write("Введите число: ");
        s = Console.ReadLine(); // ввод
        if (s == "Q") break; // выход из цикла по условию
        if (double.TryParse(s, out n)) // преобразование в double
        { 
            sum += n; // суммирование чисел
            Console.WriteLine("сумма = " + sum); 
        }
    }
}
con124();

// Пример 5. Реализация многократного ввода: цикл do...while
void con125()
{
    // объявляем и инициализируем переменные
    double n = 0, sum = 0; string s = "";
    do
    {
        Console.Write("Введите число: ");
        s = Console.ReadLine(); // ввод
        if (double.TryParse(s, out n)) // преобразование в double
        { 
            sum += n; // суммирование чисел
            Console.WriteLine("сумма = " + sum); 
        }
    // повторяем ввод до тех пор, пока не введен символ “Q”
    } 
    while (s!="Q"); // выход из цикла по условию
}
con125();

// Пример 6*. Вклады в банках с простыми и сложными процентами (цикл while). Сравнение сумм в банках
void con126()
{
    Console.Write("Введите начальный вклад (от 100 до 500 руб: ");
    double vklad = double.Parse(Console.ReadLine());
    Console.Write("Введите процентную ставку (от 10 до 30): ");
    double proc = double.Parse(Console.ReadLine());
    // задаем начальные значения
    double sum1=vklad, sum2=vklad; int god=0;
    while (sum1 < 2*vklad) // условие - удвоения суммы
    {
        // выполняем вычисления накопленных сумм и задаем приращение года
        sum1 += proc*vklad/100; sum2 *= (1+proc/100); god++;
        Console.WriteLine("год {0}, банк1 = {1}, банк2 = {2}", god, sum1, sum2);
    }
    Console.ReadKey();
}
con126();